{
    "title": "Kenneth Sorrell's Projects",
    "project-list":[
        {
            "title":"Office Locations Map",
            "client":"TransPerfect Translations",
            "date":"03/01/2020",
            "cover-image":"",
            "urls":{
                "live":["https://www.transperfectlegal.com/locations/map", "https://globallink.transperfect.com/our-offices"],
                "locally-hosted":"",
                "blogs": ["https://www.newmediacampaigns.com/work/transperfect-globallink-b2b-web-design"]
            },
            "description":{
                "short":"This application uses data fetched from a CMS, maintained by the Operations at TransPerfect, to populate an interavtive map with informaation regarding TransPerfect global office locations.",
                "problem":"Prior to this project, several of our websites contained pages with static SVG maps displaying our office locations. Due to the fact that there are 90+ offices located around the world, and information like street address, phone number, and email addresses regarding these locations frequently changed, maintaining several static pages became impractical.",
                "solutions":"This process was automated by creating a module on one of our internal sites where information regarding office locations could be easy maintained by the Operations team via the CMS. For there, using this data to populate a map using a third-party API was straight forward. We even took this a step further by creating a script tag that makes installing this map on new pages easy, and documentation that makes map customization simple."
            },
            "technologies": {
                "frontend":["Vanilla JavaScript", "HTML", "CSS", "Google Maps APIs"],
                "backend": ["Drupal CMS", "PHP"]
            }
            
        },
        { 
            "title":"ECommerce Checkout Integration",
            "client":"Wordfast",
            "date":"11/01/2020",
            "cover-image":"",
            "urls":{
                "live":["https://www.wordfast.com/buy"],
                "locally-hosted":""
            },
            "description":{
                "short":"This page allows client (translators) to buy Wordfast products.",
                "problem":"Wordfast’s previous ecommerce platform, MyCommerce by Digital River, did not satisfy business needs, or provide an API. In addtition, the PHP script used to perform CRUD operations on our locally hosted client/invoice database was outdated, and no longer maintained.",
                "solutions":"After analyzing the logic behind the previous PHP script, we were able to create webhooks using the Paddle API to automatically create user accounts after purchase, send clients confirmations, notify sales of a transaction, create discounts/interactions based on client location, and more."
            },
            "technologies": {
                "frontend":["Vanilla JavaScript", "HTML", "CSS", "Paddle API"],
                "backend": ["PHP", "MySQL"]
            }
            
        },
        {
            "title":"OGC Construction Website",
            "client":"OGC Construction",
            "date":"03/01/2021",
            "cover-image":"",
            "urls":{
                "live":["", ""],
                "locally-hosted":""
            },
            "description":{
                "short":"This us a general website Client login feature coming soon!",
                "problem":"Prior to this project, several of our websites contained pages with static SVG maps displaying our office locations. Due to the fact that there are 90+ offices located around the world, and information like street address, phone number, and email addresses regarding these locations frequently changed, maintaining several static pages became impractical.",
                "solutions":"My team and I decided to automate the process by creating a module on one of our internal sites where information regarding office locations could be easy maintained by the Operations team via the CMS. For there, using this data to populate a map using a third-party API was straight forward. We even took this a step further by creating a script tag that makes installing this map on new pages easy, and documentation that makes map customization simple."
            },
            "technologies": {
                "frontend":["React", "SVG", "Animation" ],
                "backend": ["Node.js","Express", "NoSQL", "MongoDB", "JSON"]
            }
        },
        {
            "title":"TransPerfect Client Feedback Survey",
            "client":"TransPerfect Translations",
            "date":"05/01/2019",
            "cover-image":"",
            "urls":{
                "live":[""],
                "locally-hosted":""
            },
            "description":{
                "short":"This mini web application allows client feedback survey content to be translated into several languages quickly, one a single page.",
                "problem":"Since TransPerfect in first and formost a translation company, our annual and quarterly client surveys need to be available in multiple languages. Older versions of this survey were, in fact, split into multiple static pages, one page for every language. Maintaining up to 16+ languages per survey became impractical.",
                "solutions":""
            },
            "technologies": {
                "frontend":["Vanilla JavaScript", "HTML", "CSS" ],
                "backend": ["JSON", "jsonbin.io"]
            }
        },
        {
            "title":"Industrial Char Panel",
            "client":"Personal",
            "date":"06/01/2017",
            "cover-image":"",
            "urls":{
                "live":[""],
                "locally-hosted":""
            },
            "description":{
                "short":"This animation was inspired by my daily 1.5-hour morning commute to Midtown Manhattan via NJ Trainst rail.",
                "problem":"",
                "solutions":""
            },
            "technologies": {
                "frontend":["Vanilla JavaScript", "HTML", "CSS" ],
                "backend": ["JSON", "jsonbin.io"]
            }
        },
        {
            "title":"Chrome extention - Chic Tab",
            "client":"Personal",
            "date":"08/01/2017",
            "cover-image":"",
            "urls":{
                "live":[""],
                "locally-hosted":""
            },
            "description":{
                "short":"Opening a new browser tab never felt so good. In addition to your usual list of frequently visited pages, get a beautiful animation of the sky that changes based on the time of day.",
                "problem":"",
                "solutions":""
            },
            "technologies": {
                "frontend":["Vanilla JavaScript", "HTML", "CSS" ],
                "backend": ["JSON", "jsonbin.io"]
            }
        }
        
    ]

}